from objects import check_str
import pytest


@pytest.mark.parametrize(
    'my_str, expected',
    (
        ['(((([{}]))))', 'Сбалансированно'],
        ['[([])((([[[]]])))]{()}', 'Сбалансированно'],
        ['{{[()]}}', 'Сбалансированно'],
        ['}{}', 'Несбалансированно'],
        ['{{[(])]}}', 'Несбалансированно'],
        ['[[{())}]', 'Несбалансированно'],
        [')(', 'Несбалансированно'],
        ['({)}', 'Несбалансированно'],
        ['(){}[]', 'Сбалансированно'],
        ['()[](){}}', 'Несбалансированно'],
        ['()[](){}}}', 'Несбалансированно'],
        ['({[]}())', 'Сбалансированно'],
        ['()[](){{})', 'Несбалансированно'],
        ['((((((', 'Несбалансированно'],
        ['(((((())', 'Несбалансированно']
    )
)
def test_check_str(my_str, expected):
    actual = check_str(my_str)
    assert actual == expected
